unit_4/w11d03/instructor_examples/songs_app_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        render json: { status: 200, songs: Song.all }

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Song.find(params[:id])

INSERT INTO "songs" ("title", "artist_name", "artwork") VALUES ($1, $2, $3) RETURNING "id"  [["title", "postman"], ["artist_name", "queen"], ["artwork", "None"]]
---
    def create
        song = Song.new(song_params)

        if song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "artist_name" = $2, "artwork" = $3 WHERE "songs"."id" = $4  [["title", "postman"], ["artist_name", "Maine Geese"], ["artwork", "None"], ["id", 5]]
---
    def update
        song = Song.find(params[:id])
        song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 5]]
---
    def destroy
        song = Song.destroy(params[:id])